Lambros2014/SAM4L/EMECS-SAM4L/src/SAM4L_XPRO.h
/*
 * SAM4L_XPRO.h
 *
 * Created: 25.10.2012 08:26:53
 *  Author: Are.Halvorsen
 */ 


#ifndef SAM4L_XPRO_H_
#define SAM4L_XPRO_H_

// #define EXT1_PIN1 ID system, connected to EDBG
// #define EXT1_PIN2 GND
#define EXT1_GPIO03	GPIO_PA04
#define EXT1_PIN03	PIN_PA04
#define EXT1_GPIO04	GPIO_PA05
#define EXT1_PIN04	PIN_PA05
#define EXT1_GPIO05	GPIO_PB12
#define EXT1_PIN05	PIN_PB12
#define EXT1_GPIO06	GPIO_PC02
#define EXT1_PIN06	PIN_PC02
#define EXT1_GPIO07	GPIO_PC00
#define EXT1_PIN07	PIN_PC00
#define EXT1_GPIO08	GPIO_PC01
#define EXT1_PIN08	PIN_PC01
#define EXT1_GPIO09	GPIO_PC25
#define EXT1_PIN09	PIN_PC25
#define EXT1_GPIO10	GPIO_PB13
#define EXT1_PIN10	PIN_PB13
#define EXT1_GPIO11	GPIO_PA23
#define EXT1_PIN11	PIN_PA23
#define EXT1_GPIO12	GPIO_PA24
#define EXT1_PIN12	PIN_PA24
#define EXT1_GPIO13	GPIO_PB00
#define EXT1_PIN13	PIN_PB00
#define EXT1_GPIO14	GPIO_PB01
#define EXT1_PIN14	PIN_PB01
#define EXT1_GPIO15	GPIO_PC03
#define EXT1_PIN15	PIN_PC03
#define EXT1_GPIO16	GPIO_PA22
#define EXT1_PIN16	PIN_PA22
#define EXT1_GPIO17	GPIO_PA21
#define EXT1_PIN17	PIN_PA21
#define EXT1_GPIO18	GPIO_PC30
#define EXT1_PIN18	PIN_PC30
// #define EXT1_PIN19 GND
// #define EXT1_PIN20 VCC

// Error in schematic, EXT2 and EXT3 are swapped.
// Defines are for the way the schamtic should be.

// #define EXT2_PIN1 ID system, connected to EDBG
// #define EXT2_PIN2 GND
#define EXT2_GPIO03	GPIO_PA07
#define EXT2_PIN03	PIN_PA07
#define EXT2_GPIO04	GPIO_PB02
#define EXT2_PIN04	PIN_PB02
#define EXT2_GPIO05	GPIO_PC08
#define EXT2_PIN05	PIN_PC08
#define EXT2_GPIO06	GPIO_PB10
#define EXT2_PIN06	PIN_PB10
#define EXT2_GPIO07	GPIO_PC04
#define EXT2_PIN07	PIN_PC04
#define EXT2_GPIO08	GPIO_PC05
#define EXT2_PIN08	PIN_PC05
#define EXT2_GPIO09	GPIO_PC06
#define EXT2_PIN09	PIN_PC06
#define EXT2_GPIO10	GPIO_PC09
#define EXT2_PIN10	PIN_PC09
#define EXT2_GPIO11	GPIO_PB14
#define EXT2_PIN11	PIN_PB14
#define EXT2_GPIO12	GPIO_PB15
#define EXT2_PIN12	PIN_PB15
#define EXT2_GPIO13	GPIO_PC26
#define EXT2_PIN13	PIN_PC26
#define EXT2_GPIO14	GPIO_PC27
#define EXT2_PIN14	PIN_PC27
#define EXT2_GPIO15	GPIO_PB11
#define EXT2_PIN15	PIN_PB11
#define EXT2_GPIO16	GPIO_PA22
#define EXT2_PIN16	PIN_PA22
#define EXT2_GPIO17	GPIO_PA21
#define EXT2_PIN17	PIN_PA21
#define EXT2_GPIO18	GPIO_PC30
#define EXT2_PIN18	PIN_PC30
// #define EXT2_PIN19 GND
// #define EXT2_PIN20 VCC


// #define EXT3_PIN1 ID system, connected to EDBG
// #define EXT3_PIN2 GND
#define EXT3_GPIO03	GPIO_PB03
#define EXT3_PIN03	PIN_PB03
#define EXT3_GPIO04	GPIO_PB04
#define EXT3_PIN04	PIN_PB04
#define EXT3_GPIO05	GPIO_PC15
#define EXT3_PIN05	PIN_PC15
#define EXT3_GPIO06	GPIO_PC16
#define EXT3_PIN06	PIN_PC16
#define EXT3_GPIO07	GPIO_PA08
#define EXT3_PIN07	PIN_PA08
#define EXT3_GPIO08	GPIO_PA09
#define EXT3_PIN08	PIN_PA09
#define EXT3_GPIO09	GPIO_PA06
#define EXT3_PIN09	PIN_PA06
#define EXT3_GPIO10	GPIO_PA10
#define EXT3_PIN10	PIN_PA10
#define EXT3_GPIO11	GPIO_PB14
#define EXT3_PIN11	PIN_PB14
#define EXT3_GPIO12	GPIO_PB15
#define EXT3_PIN12	PIN_PB15
#define EXT3_GPIO13	GPIO_PC26
#define EXT3_PIN13	PIN_PC26
#define EXT3_GPIO14	GPIO_PC27
#define EXT3_PIN14	PIN_PC27
#define EXT3_GPIO15	GPIO_PA17
#define EXT3_PIN15	PIN_PA17
#define EXT3_GPIO16	GPIO_PA20
#define EXT3_PIN16	PIN_PA20
#define EXT3_GPIO17	GPIO_PA19
#define EXT3_PIN17	PIN_PA19
#define EXT3_GPIO18	GPIO_PA18
#define EXT3_PIN18	PIN_PA18
// #define EXT1_PIN19 GND
// #define EXT1_PIN20 VCC

#define LED0_GPIO		GPIO_PC07
#define LED0_PIN		PIN_PC07
#define BUTTON0_GPIO	GPIO_PC24
#define BUTTON0_PIN		PIN_PC07

#endif /* SAM4L_XPRO_H_ */